Revit 2024 API
TableCellStyle.IsEnabled Property
 Gets or sets the status whether this cell is enabled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsEnabled { get; set; }
Visual Basic
Public Property IsEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool IsEnabled {
	bool get ();
	void set (bool value);
}
Field Value
 True if this cell is enabled; otherwise False.
See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace